s070388s/eez-bb3plus-cm5-mcu/CubeMX/H7R7L8H8.ioc
#MicroXplorer Configuration settings - do not modify
Appli.IPs=CORTEX_M7_APPLI\:I,GPDMA1,HPDMA1,LINKEDLIST,RCC\:I,GPIO,NVIC2\:I,ETH,I2C2,SDMMC1,SPI2,SPI4,SPI5,USB_OTG_FS,USB_OTG_FS1,USB_OTG_HS,USB_OTG_HS1,DMA2D,JPEG,LTDC,DEBUG,UART7,UART4,FLASH,HDMI_CEC
Boot.IPs=CORTEX_M7_BOOT\:I,GPDMA1,HPDMA1,LINKEDLIST,RCC,GPIO,NVIC1\:I,DEBUG,XSPI1,XSPI2,FLASH,EXTMEM_MANAGER,MEMORYMAP\:I
CAD.formats=[]
CAD.pinconfig=Dual
CAD.provider=
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region7_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.AccessPermission-Cortex_Memory_Protection_Unit_Region8_Settings=MPU_REGION_FULL_ACCESS
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x70000000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings=0x70000000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings=0x90000000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings=0x20000000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region5_Settings=0x24000000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region6_Settings=0x2406c000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region7_Settings=0x24070000
CORTEX_M7_APPLI.BaseAddress-Cortex_Memory_Protection_Unit_Region8_Settings=0x25000000
CORTEX_M7_APPLI.CPU_DCache=Enabled
CORTEX_M7_APPLI.CPU_ICache=Enabled
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region7_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.DisableExec-Cortex_Memory_Protection_Unit_Region8_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region7_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.Enable-Cortex_Memory_Protection_Unit_Region8_Settings=MPU_REGION_ENABLE
CORTEX_M7_APPLI.IPParameters=CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,Size-Cortex_Memory_Protection_Unit_Region0_Settings,SubRegionDisable-Cortex_Memory_Protection_Unit_Region0_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region0_Settings,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,Size-Cortex_Memory_Protection_Unit_Region1_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region1_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region1_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region1_Settings,Enable-Cortex_Memory_Protection_Unit_Region2_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings,Size-Cortex_Memory_Protection_Unit_Region2_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region2_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region2_Settings,Enable-Cortex_Memory_Protection_Unit_Region3_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings,Size-Cortex_Memory_Protection_Unit_Region3_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region3_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region3_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings,Enable-Cortex_Memory_Protection_Unit_Region4_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings,Size-Cortex_Memory_Protection_Unit_Region4_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region4_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region4_Settings,Enable-Cortex_Memory_Protection_Unit_Region5_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region5_Settings,Size-Cortex_Memory_Protection_Unit_Region5_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region5_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region5_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region5_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region5_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region5_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region5_Settings,Enable-Cortex_Memory_Protection_Unit_Region6_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region6_Settings,Size-Cortex_Memory_Protection_Unit_Region6_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region6_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region6_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region6_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region6_Settings,Enable-Cortex_Memory_Protection_Unit_Region7_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region7_Settings,Size-Cortex_Memory_Protection_Unit_Region7_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region7_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region7_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region7_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region7_Settings,Enable-Cortex_Memory_Protection_Unit_Region8_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region8_Settings,Size-Cortex_Memory_Protection_Unit_Region8_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region8_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region8_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region8_Settings
CORTEX_M7_APPLI.IsBufferable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7_APPLI.IsBufferable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7_APPLI.IsBufferable-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7_APPLI.IsBufferable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7_APPLI.IsBufferable-Cortex_Memory_Protection_Unit_Region7_Settings=MPU_ACCESS_BUFFERABLE
CORTEX_M7_APPLI.IsCacheable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7_APPLI.IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7_APPLI.IsCacheable-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_ACCESS_CACHEABLE
CORTEX_M7_APPLI.IsShareable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_SHAREABLE
CORTEX_M7_APPLI.IsShareable-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_ACCESS_SHAREABLE
CORTEX_M7_APPLI.IsShareable-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_ACCESS_SHAREABLE
CORTEX_M7_APPLI.IsShareable-Cortex_Memory_Protection_Unit_Region7_Settings=MPU_ACCESS_SHAREABLE
CORTEX_M7_APPLI.MPU_Control=MPU_PRIVILEGED_DEFAULT
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_4GB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_SIZE_32MB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_SIZE_2MB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_SIZE_32MB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_SIZE_64KB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_REGION_SIZE_512KB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region6_Settings=MPU_REGION_SIZE_16KB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region7_Settings=MPU_REGION_SIZE_8KB
CORTEX_M7_APPLI.Size-Cortex_Memory_Protection_Unit_Region8_Settings=MPU_REGION_SIZE_16MB
CORTEX_M7_APPLI.SubRegionDisable-Cortex_Memory_Protection_Unit_Region0_Settings=0x87
CORTEX_M7_APPLI.TypeExtField-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_TEX_LEVEL1
CORTEX_M7_APPLI.TypeExtField-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_TEX_LEVEL1
CORTEX_M7_APPLI.TypeExtField-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_TEX_LEVEL1
CORTEX_M7_APPLI.TypeExtField-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_TEX_LEVEL1
CORTEX_M7_APPLI.TypeExtField-Cortex_Memory_Protection_Unit_Region5_Settings=MPU_TEX_LEVEL1
CORTEX_M7_APPLI.TypeExtField-Cortex_Memory_Protection_Unit_Region8_Settings=MPU_TEX_LEVEL1
CORTEX_M7_BOOT.CPU_DCache=Enabled
CORTEX_M7_BOOT.CPU_ICache=Enabled
CORTEX_M7_BOOT.IPParameters=CPU_ICache,CPU_DCache
DMA2D.ColorMode=DMA2D_OUTPUT_ARGB8888
DMA2D.IPParameters=ColorMode
ETH.IPParameters=MediaInterface
ETH.MediaInterface=HAL_ETH_RMII_MODE
EXTMEM_MANAGER.IPParameters=RefParam_BOOT_enable,RefParam_MEMORY_1_Instance,RefParam_MEMORY_1_ConfigType,RefParam_MEMORY_2_Driver_Selection,RefParam_MEMORY_2_ConfigType,RefParam_MEMORY_2_NumberOfConfig
EXTMEM_MANAGER.RefParam_BOOT_enable=true
EXTMEM_MANAGER.RefParam_MEMORY_1_ConfigType=EXTMEM_LINK_CONFIG_8LINES
EXTMEM_MANAGER.RefParam_MEMORY_1_Instance=XSPI2
EXTMEM_MANAGER.RefParam_MEMORY_2_ConfigType=EXTMEM_LINK_CONFIG_16LINES
EXTMEM_MANAGER.RefParam_MEMORY_2_Driver_Selection=EXTMEM_PSRAM
EXTMEM_MANAGER.RefParam_MEMORY_2_NumberOfConfig=1
ExtMemLoader.IPs=EXTMEM_LOADER\:I,EXTMEM_MANAGER\:I,GPDMA1\:I,HPDMA1\:I,LINKEDLIST\:I,GPIO
FLASH.IPParameters=OB_User_Configuration1_active,OB_IWDG1_SW_UI,OB_XSPI1_HSLV_UI,OB_XSPI2_HSLV_UI,OB_ECC_ON_SRAM_UI
FLASH.OB_ECC_ON_SRAM_UI=OB_AXISRAM_ECC__NOUPD
FLASH.OB_IWDG1_SW_UI=OB_IWDG_SW
FLASH.OB_User_Configuration1_active=true
FLASH.OB_XSPI1_HSLV_UI=OB_XSPI1_HSLV_ENABLE
FLASH.OB_XSPI2_HSLV_UI=OB_XSPI2_HSLV_ENABLE
File.Version=6
GPIO.groupedBy=Group By Peripherals
I2C2.IPParameters=Timing
I2C2.Timing=0x20C0EDFF
KeepUserPlacement=false
LTDC.ActiveW=800
LTDC.Alpha_L0=255
LTDC.FBStartAdress_L0=0x90000000
LTDC.HBP=8
LTDC.HFP=8
LTDC.HSPolarity=LTDC_HSPOLARITY_AL
LTDC.HSync=16
LTDC.IPParameters=HSync,HBP,ActiveW,HFP,VSync,VBP,VFP,Layers,Alpha_L0,WindowX1_L0,WindowY1_L0,ImageWidth_L0,ImageHeight_L0,FBStartAdress_L0,HSPolarity,PixelFormat_L0
LTDC.ImageHeight_L0=480
LTDC.ImageWidth_L0=800
LTDC.Layers=0
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB888
LTDC.VBP=16
LTDC.VFP=16
LTDC.VSync=32
LTDC.WindowX1_L0=800
LTDC.WindowY1_L0=480
MMTAppReg1.MEMORYMAP.AppRegionName=DTCM
MMTAppReg1.MEMORYMAP.ContextName=Boot
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg1.MEMORYMAP.Name=DTCM
MMTAppReg1.MEMORYMAP.Size=65536
MMTAppReg1.MEMORYMAP.StartAddress=0x20000000
MMTAppReg2.MEMORYMAP.AppRegionName=RAM
MMTAppReg2.MEMORYMAP.ContextName=Boot
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg2.MEMORYMAP.DefaultDataRegion=true
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg2.MEMORYMAP.Name=RAM
MMTAppReg2.MEMORYMAP.Size=465920
MMTAppReg2.MEMORYMAP.StartAddress=0x24000000
MMTAppReg3.MEMORYMAP.AppRegionName=ITCM
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=Boot
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Cacheability
MMTAppReg3.MEMORYMAP.Name=ITCM
MMTAppReg3.MEMORYMAP.Size=65536
MMTAppReg3.MEMORYMAP.StartAddress=0x00000000
MMTAppReg4.MEMORYMAP.AP=RO_priv_only
MMTAppReg4.MEMORYMAP.AppRegionName=FLASH
MMTAppReg4.MEMORYMAP.Cacheability=WTRA
MMTAppReg4.MEMORYMAP.ContextName=Boot
MMTAppReg4.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg4.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg4.MEMORYMAP.DefaultDataRegion=false
MMTAppReg4.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg4.MEMORYMAP.MemType=ROM
MMTAppReg4.MEMORYMAP.Name=FLASH
MMTAppReg4.MEMORYMAP.Size=65536
MMTAppReg4.MEMORYMAP.StartAddress=0x08000000
MMTAppReg5.MEMORYMAP.AppRegionName=DTCM
MMTAppReg5.MEMORYMAP.ContextName=Appli
MMTAppReg5.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg5.MEMORYMAP.DefaultDataRegion=true
MMTAppReg5.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg5.MEMORYMAP.Name=DTCM
MMTAppReg5.MEMORYMAP.Size=65536
MMTAppReg5.MEMORYMAP.StartAddress=0x20000000
MMTAppReg6.MEMORYMAP.AppRegionName=RAM
MMTAppReg6.MEMORYMAP.ContextName=Appli
MMTAppReg6.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg6.MEMORYMAP.DefaultDataRegion=true
MMTAppReg6.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name
MMTAppReg6.MEMORYMAP.InvalidRegion=true
MMTAppReg6.MEMORYMAP.Name=RAM
MMTAppReg6.MEMORYMAP.Size=465920
MMTAppReg6.MEMORYMAP.StartAddress=0x24000000
MMTAppReg7.MEMORYMAP.AppRegionName=ITCM
MMTAppReg7.MEMORYMAP.Cacheability=WTRA
MMTAppReg7.MEMORYMAP.ContextName=Appli
MMTAppReg7.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg7.MEMORYMAP.DefaultDataRegion=false
MMTAppReg7.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,Cacheability
MMTAppReg7.MEMORYMAP.Name=ITCM
MMTAppReg7.MEMORYMAP.Size=65536
MMTAppReg7.MEMORYMAP.StartAddress=0x00000000
MMTAppReg8.MEMORYMAP.AP=RO_priv_only
MMTAppReg8.MEMORYMAP.AppRegionName=FLASH
MMTAppReg8.MEMORYMAP.Cacheability=WTRA
MMTAppReg8.MEMORYMAP.ContextName=Appli
MMTAppReg8.MEMORYMAP.CoreName=ARM Cortex-M7
MMTAppReg8.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg8.MEMORYMAP.DefaultDataRegion=false
MMTAppReg8.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg8.MEMORYMAP.MemType=ROM
MMTAppReg8.MEMORYMAP.Name=FLASH
MMTAppReg8.MEMORYMAP.Size=65536
MMTAppReg8.MEMORYMAP.StartAddress=0x08000000
MMTAppRegionsCount=8
MMTConfigApplied=false
MMTSectionSuffix=_Section
Mcu.CPN=STM32H7R7L8H6H
Mcu.Context0=Boot
Mcu.Context1=Appli
Mcu.Context2=ExtMemLoader
Mcu.ContextNb=3
Mcu.Family=STM32H7
Mcu.IP0=CORTEX_M7_APPLI
Mcu.IP1=CORTEX_M7_BOOT
Mcu.IP10=MEMORYMAP
Mcu.IP11=NVIC2
Mcu.IP12=NVIC1
Mcu.IP13=RCC
Mcu.IP14=SDMMC1
Mcu.IP15=SPI2
Mcu.IP16=SPI4
Mcu.IP17=SPI5
Mcu.IP18=UART4
Mcu.IP19=UART7
Mcu.IP2=DEBUG
Mcu.IP20=USB_OTG_FS
Mcu.IP21=USB_OTG_HS
Mcu.IP22=USB_OTG_HS1
Mcu.IP23=XSPI1
Mcu.IP24=XSPI2
Mcu.IP3=DMA2D
Mcu.IP4=ETH
Mcu.IP5=EXTMEM_MANAGER
Mcu.IP6=FLASH
Mcu.IP7=I2C2
Mcu.IP8=JPEG
Mcu.IP9=LTDC
Mcu.IPNb=25
Mcu.Name=STM32H7R7L8HxH
Mcu.Package=TFBGA225 HEXA SMPS
Mcu.Pin0=PE0
Mcu.Pin1=PF3
Mcu.Pin10=PB8
Mcu.Pin100=PF15
Mcu.Pin101=PP12
Mcu.Pin102=PP14
Mcu.Pin103=PP2
Mcu.Pin104=PP5
Mcu.Pin105=PO2
Mcu.Pin106=PP1
Mcu.Pin107=PB11
Mcu.Pin108=PB13
Mcu.Pin109=PA6
Mcu.Pin11=PE2
Mcu.Pin110=PB0
Mcu.Pin111=PF13
Mcu.Pin112=PF14
Mcu.Pin113=PP11
Mcu.Pin114=PP15
Mcu.Pin115=PP3
Mcu.Pin116=PP0
Mcu.Pin117=PP7
Mcu.Pin118=PP8
Mcu.Pin119=PB10
Mcu.Pin12=PB5
Mcu.Pin120=PB1
Mcu.Pin121=PE8
Mcu.Pin122=PE10
Mcu.Pin123=PP13
Mcu.Pin124=PP4
Mcu.Pin125=PO4
Mcu.Pin126=PP6
Mcu.Pin127=PO0
Mcu.Pin128=PP9
Mcu.Pin129=VP_DMA2D_VS_DMA2D
Mcu.Pin13=PF4
Mcu.Pin130=VP_EXTMEM_MANAGER_SIG_Activate_EXTMEM
Mcu.Pin131=VP_FLASH_SIG_Activate_FlashIP
Mcu.Pin132=VP_JPEG_VS_JPEG
Mcu.Pin133=VP_RCC_VS_RMII
Mcu.Pin134=VP_USB_OTG_HS1_USB_OTG_HS_DR
Mcu.Pin135=VP_XSPI1_VS_hexa
Mcu.Pin136=VP_XSPI2_VS_octo
Mcu.Pin137=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin14=PF0
Mcu.Pin15=PD7
Mcu.Pin16=PM11
Mcu.Pin17=PM9
Mcu.Pin18=PM5
Mcu.Pin19=PM2
Mcu.Pin2=PF2
Mcu.Pin20=PG0
Mcu.Pin21=PE13
Mcu.Pin22=PD1
Mcu.Pin23=PC10
Mcu.Pin24=PC11
Mcu.Pin25=PB9
Mcu.Pin26=PB3(JTDO/TRACESWO)
Mcu.Pin27=PF1
Mcu.Pin28=PG2
Mcu.Pin29=PM13
Mcu.Pin3=PG3
Mcu.Pin30=PM14
Mcu.Pin31=PM8
Mcu.Pin32=PE11
Mcu.Pin33=PD0
Mcu.Pin34=PA12
Mcu.Pin35=PA11
Mcu.Pin36=PC14-OSC32_IN(OSC32_IN)
Mcu.Pin37=PB7
Mcu.Pin38=PB4(NJTRST)
Mcu.Pin39=PD5
Mcu.Pin4=PM12
Mcu.Pin40=PE15
Mcu.Pin41=PC12
Mcu.Pin42=PA14(JTCK/SWCLK)
Mcu.Pin43=PA9
Mcu.Pin44=PC8
Mcu.Pin45=PE6
Mcu.Pin46=PE4
Mcu.Pin47=PB6
Mcu.Pin48=PD6
Mcu.Pin49=PG1
Mcu.Pin5=PM6
Mcu.Pin50=PE12
Mcu.Pin51=PA13(JTMS/SWDIO)
Mcu.Pin52=PA10
Mcu.Pin53=PC9
Mcu.Pin54=PC6
Mcu.Pin55=PG14
Mcu.Pin56=PG12
Mcu.Pin57=PG11
Mcu.Pin58=PA8
Mcu.Pin59=PC7
Mcu.Pin6=PM3
Mcu.Pin60=PN1
Mcu.Pin61=PG13
Mcu.Pin62=PA15(JTDI)
Mcu.Pin63=PN3
Mcu.Pin64=PN0
Mcu.Pin65=PN11
Mcu.Pin66=PF7
Mcu.Pin67=PF6
Mcu.Pin68=PN10
Mcu.Pin69=PN9
Mcu.Pin7=PD3
Mcu.Pin70=PN2
Mcu.Pin71=PF9
Mcu.Pin72=PF10
Mcu.Pin73=PN6
Mcu.Pin74=PH0-OSC_IN(PH0)
Mcu.Pin75=PH1-OSC_OUT(PH1)
Mcu.Pin76=PN8
Mcu.Pin77=PN4
Mcu.Pin78=PN5
Mcu.Pin79=PC1
Mcu.Pin8=PE14
Mcu.Pin80=PC2
Mcu.Pin81=PC3
Mcu.Pin82=PA2
Mcu.Pin83=PC4
Mcu.Pin84=PB12
Mcu.Pin85=PD14
Mcu.Pin86=PA0
Mcu.Pin87=PA1
Mcu.Pin88=PA4
