s070388s/eez-bb3plus-cm5-mcu/CubeMX/H7R7L8H8.ioc
Mcu.Pin89=PA7
Mcu.Pin9=PD2
Mcu.Pin90=PF11
Mcu.Pin91=PE7
Mcu.Pin92=PO3
Mcu.Pin93=PP10
Mcu.Pin94=PB14
Mcu.Pin95=PB15
Mcu.Pin96=PA3
Mcu.Pin97=PA5
Mcu.Pin98=PC5
Mcu.Pin99=PB2
Mcu.PinsNb=138
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32H7R7L8HxH
MxCube.Version=6.15.0
MxDb.Version=DB.6.0.150
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.ForceEnableDMAVector=true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.LTDC_IRQn=true\:0\:0\:false\:false\:true\:true\:true\:true
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=RGB888
PA0.PinAttribute=Appli
PA0.Signal=LTDC_G3
PA1.GPIOParameters=PinAttribute
PA1.Locked=true
PA1.Mode=RGB888
PA1.PinAttribute=Appli
PA1.Signal=LTDC_G2
PA10.GPIOParameters=PinAttribute
PA10.Locked=true
PA10.Mode=RGB888
PA10.PinAttribute=Appli
PA10.Signal=LTDC_B4
PA11.GPIOParameters=PinAttribute
PA11.Locked=true
PA11.Mode=RGB888
PA11.PinAttribute=Appli
PA11.Signal=LTDC_B3
PA12.GPIOParameters=GPIO_Label,PinAttribute
PA12.GPIO_Label=DIB1/DIB3_SCK
PA12.Locked=true
PA12.Mode=Full_Duplex_Master
PA12.PinAttribute=Appli
PA12.Signal=SPI2_SCK
PA13(JTMS/SWDIO).GPIOParameters=GPIO_Label
PA13(JTMS/SWDIO).GPIO_Label=SWDIO
PA13(JTMS/SWDIO).Locked=true
PA13(JTMS/SWDIO).Mode=Serial_Wire
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).GPIOParameters=GPIO_Label
PA14(JTCK/SWCLK).GPIO_Label=SWCLK
PA14(JTCK/SWCLK).Locked=true
PA14(JTCK/SWCLK).Mode=Serial_Wire
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15(JTDI).GPIOParameters=PinAttribute
PA15(JTDI).Locked=true
PA15(JTDI).Mode=RGB888
PA15(JTDI).PinAttribute=Appli
PA15(JTDI).Signal=LTDC_R5
PA2.GPIOParameters=PinAttribute
PA2.Locked=true
PA2.Mode=RMII
PA2.PinAttribute=Appli
PA2.Signal=ETH_MDIO
PA3.GPIOParameters=PinAttribute
PA3.Locked=true
PA3.Mode=RGB888
PA3.PinAttribute=Appli
PA3.Signal=LTDC_DE
PA4.GPIOParameters=PinAttribute
PA4.Locked=true
PA4.Mode=RGB888
PA4.PinAttribute=Appli
PA4.Signal=LTDC_R3
PA5.GPIOParameters=PinAttribute
PA5.Locked=true
PA5.Mode=RGB888
PA5.PinAttribute=Appli
PA5.Signal=LTDC_CLK
PA6.GPIOParameters=PinAttribute
PA6.Locked=true
PA6.Mode=RGB888
PA6.PinAttribute=Appli
PA6.Signal=LTDC_B7
PA7.GPIOParameters=PinAttribute
PA7.Locked=true
PA7.Mode=RMII
PA7.PinAttribute=Appli
PA7.Signal=ETH_RMII_CRS_DV
PA8.GPIOParameters=PinAttribute
PA8.Locked=true
PA8.Mode=RGB888
PA8.PinAttribute=Appli
PA8.Signal=LTDC_B6
PA9.GPIOParameters=PinAttribute
PA9.Locked=true
PA9.Mode=RGB888
PA9.PinAttribute=Appli
PA9.Signal=LTDC_B5
PB0.GPIOParameters=GPIO_Label,PinAttribute
PB0.GPIO_Label=DVID_SEL1
PB0.Locked=true
PB0.PinAttribute=Appli
PB0.Signal=GPIO_Output
PB1.GPIOParameters=GPIO_Label,PinAttribute
PB1.GPIO_Label=DIB1_IRQ
PB1.Locked=true
PB1.PinAttribute=Free
PB1.Signal=GPXTI1
PB10.GPIOParameters=PinAttribute
PB10.Locked=true
PB10.Mode=Activate Rx Err signal
PB10.PinAttribute=Appli
PB10.Signal=ETH_MII_RX_ER
PB11.GPIOParameters=PinAttribute
PB11.Locked=true
PB11.Mode=RGB888
PB11.PinAttribute=Appli
PB11.Signal=LTDC_G6
PB12.GPIOParameters=PinAttribute
PB12.Locked=true
PB12.Mode=RGB888
PB12.PinAttribute=Appli
PB12.Signal=LTDC_G5
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.Mode=RGB888
PB13.PinAttribute=Appli
PB13.Signal=LTDC_G4
PB14.GPIOParameters=GPIO_Label,PinAttribute
PB14.GPIO_Label=RS485_TX_EN/DOUT2
PB14.Locked=true
PB14.Mode=Hardware Flow Control (RS485)
PB14.PinAttribute=Appli
PB14.Signal=UART4_DE
PB15.GPIOParameters=PinAttribute
PB15.Locked=true
PB15.Mode=RGB888
PB15.PinAttribute=Appli
PB15.Signal=LTDC_G7
PB2.GPIOParameters=PinAttribute
PB2.Locked=true
PB2.Mode=RGB888
PB2.PinAttribute=Appli
PB2.Signal=LTDC_B2
PB3(JTDO/TRACESWO).GPIOParameters=PinAttribute
PB3(JTDO/TRACESWO).Locked=true
PB3(JTDO/TRACESWO).Mode=RGB888
PB3(JTDO/TRACESWO).PinAttribute=Appli
PB3(JTDO/TRACESWO).Signal=LTDC_R4
PB4(NJTRST).GPIOParameters=GPIO_Label,PinAttribute
PB4(NJTRST).GPIO_Label=DIB1_CSA
PB4(NJTRST).Locked=true
PB4(NJTRST).Mode=NSS_Signal_Hard_Output
PB4(NJTRST).PinAttribute=Appli
PB4(NJTRST).Signal=SPI2_NSS
PB5.GPIOParameters=PinAttribute
PB5.Locked=true
PB5.Mode=RGB888
PB5.PinAttribute=Appli
PB5.Signal=LTDC_R2
PB6.GPIOParameters=GPIO_Label,PinAttribute
PB6.GPIO_Label=DVID_CEC
PB6.Locked=true
PB6.PinAttribute=Appli
PB6.Signal=CEC
PB7.GPIOParameters=PinAttribute
PB7.Locked=true
PB7.Mode=RMII
PB7.PinAttribute=Appli
PB7.Signal=ETH_RMII_TXD1
PB8.GPIOParameters=PinAttribute
PB8.Locked=true
PB8.Mode=mmc_8_bits_Wide_bus
PB8.PinAttribute=Appli
PB8.Signal=SDMMC1_D4
PB9.GPIOParameters=PinAttribute
PB9.Locked=true
PB9.Mode=mmc_8_bits_Wide_bus
PB9.PinAttribute=Appli
PB9.Signal=SDMMC1_D5
PC1.GPIOParameters=PinAttribute
PC1.Locked=true
PC1.Mode=RMII
PC1.PinAttribute=Appli
PC1.Signal=ETH_MDC
PC10.GPIOParameters=PinAttribute
PC10.Locked=true
PC10.Mode=mmc_8_bits_Wide_bus
PC10.PinAttribute=Appli
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=PinAttribute
PC11.Locked=true
PC11.Mode=mmc_8_bits_Wide_bus
PC11.PinAttribute=Appli
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=PinAttribute
PC12.Locked=true
PC12.Mode=mmc_8_bits_Wide_bus
PC12.PinAttribute=Appli
PC12.Signal=SDMMC1_CK
PC14-OSC32_IN(OSC32_IN).Locked=true
PC14-OSC32_IN(OSC32_IN).Mode=LSE-External-Clock-Source
PC14-OSC32_IN(OSC32_IN).Signal=RCC_OSC32_IN
PC2.GPIOParameters=GPIO_Label,PinAttribute
PC2.GPIO_Label=DIB1/DIB3_MISO
PC2.Locked=true
PC2.Mode=Full_Duplex_Master
PC2.PinAttribute=Appli
PC2.Signal=SPI2_MISO
PC3.GPIOParameters=GPIO_Label,PinAttribute
PC3.GPIO_Label=DIB1/DIB3_MOSI
PC3.Locked=true
PC3.Mode=Full_Duplex_Master
PC3.PinAttribute=Appli
PC3.Signal=SPI2_MOSI
PC4.GPIOParameters=PinAttribute
PC4.Locked=true
PC4.Mode=RMII
PC4.PinAttribute=Appli
PC4.Signal=ETH_RMII_RXD0
PC5.GPIOParameters=PinAttribute
PC5.Locked=true
PC5.Mode=RMII
PC5.PinAttribute=Appli
PC5.Signal=ETH_RMII_RXD1
PC6.GPIOParameters=PinAttribute
PC6.Locked=true
PC6.Mode=mmc_8_bits_Wide_bus
PC6.PinAttribute=Appli
PC6.Signal=SDMMC1_D6
PC7.GPIOParameters=PinAttribute
PC7.Locked=true
PC7.Mode=mmc_8_bits_Wide_bus
PC7.PinAttribute=Appli
PC7.Signal=SDMMC1_D7
PC8.GPIOParameters=PinAttribute
PC8.Locked=true
PC8.Mode=mmc_8_bits_Wide_bus
PC8.PinAttribute=Appli
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=PinAttribute
PC9.Locked=true
PC9.Mode=mmc_8_bits_Wide_bus
PC9.PinAttribute=Appli
PC9.Signal=SDMMC1_D1
PCC.Checker=false
PCC.Line=STM32H7R7/7S7
PCC.MCU=STM32H7R7L8HxH
PCC.PartNumber=STM32H7R7L8HxH
PCC.Series=STM32H7
PCC.Temperature=25
PCC.Vdd=3.0
PD0.GPIOParameters=GPIO_Label,PinAttribute
PD0.GPIO_Label=RS485_RX/DIN3
PD0.Locked=true
PD0.Mode=Asynchronous
PD0.PinAttribute=Appli
PD0.Signal=UART4_RX
PD1.GPIOParameters=GPIO_Label,PinAttribute
PD1.GPIO_Label=RS485_TX/DOUT3
PD1.Locked=true
PD1.Mode=Asynchronous
PD1.PinAttribute=Appli
PD1.Signal=UART4_TX
PD14.GPIOParameters=GPIO_Label
PD14.GPIO_Label=USB_FS_SEL
PD14.Locked=true
PD14.Signal=GPIO_Output
PD2.GPIOParameters=PinAttribute
PD2.Locked=true
PD2.Mode=mmc_8_bits_Wide_bus
PD2.PinAttribute=Appli
PD2.Signal=SDMMC1_CMD
PD3.GPIOParameters=PinAttribute
PD3.Locked=true
PD3.Mode=RGB888
PD3.PinAttribute=Appli
PD3.Signal=LTDC_B1
PD5.GPIOParameters=GPIO_Label,PinAttribute
PD5.GPIO_Label=DIB5_IRQ
PD5.Locked=true
PD5.PinAttribute=Free
PD5.Signal=GPXTI5
PD6.GPIOParameters=PinAttribute
PD6.Locked=true
PD6.Mode=Digital_ClockEthClk
PD6.PinAttribute=Free
PD6.Signal=ETH_CLK
PD7.GPIOParameters=PinAttribute
PD7.Locked=true
PD7.Mode=RMII
PD7.PinAttribute=Appli
PD7.Signal=ETH_RMII_REF_CLK
PE0.GPIOParameters=GPIO_Label,PinAttribute
PE0.GPIO_Label=SYSMCU_IRQ
PE0.Locked=true
PE0.PinAttribute=Free
PE0.Signal=GPXTI0
PE10.GPIOParameters=GPIO_Label,PinAttribute
PE10.GPIO_Label=LED_nACT
PE10.Locked=true
PE10.PinAttribute=Free
PE10.Signal=GPIO_Output
PE11.GPIOParameters=PinAttribute
PE11.Locked=true
PE11.Mode=RGB888
PE11.PinAttribute=Appli
PE11.Signal=LTDC_VSYNC
PE12.GPIOParameters=GPIO_Label,PinAttribute
PE12.GPIO_Label=DVID_HPA
PE12.Locked=true
PE12.PinAttribute=Free
PE12.Signal=GPXTI12
PE13.GPIOParameters=GPIO_Label,PinAttribute
PE13.GPIO_Label=DIB2/DIB5_MISO
PE13.Locked=true
PE13.Mode=Full_Duplex_Master
PE13.PinAttribute=Appli
PE13.Signal=SPI4_MISO
PE14.GPIOParameters=GPIO_Label,PinAttribute
PE14.GPIO_Label=DIB2/DIB5_MOSI
PE14.Locked=true
PE14.Mode=Full_Duplex_Master
PE14.PinAttribute=Appli
PE14.Signal=SPI4_MOSI
PE15.GPIOParameters=GPIO_Label,PinAttribute
PE15.GPIO_Label=LCD_ON
PE15.Locked=true
PE15.PinAttribute=Free
PE15.Signal=GPIO_Output
PE2.GPIOParameters=GPIO_Label,PinAttribute
PE2.GPIO_Label=DIB2/DIB5_SCK
PE2.Locked=true
PE2.Mode=Full_Duplex_Master
PE2.PinAttribute=Appli
PE2.Signal=SPI4_SCK
PE4.GPIOParameters=GPIO_Label,PinAttribute
PE4.GPIO_Label=DIB2_CSA
PE4.Locked=true
PE4.Mode=NSS_Signal_Hard_Output
PE4.PinAttribute=Appli
PE4.Signal=SPI4_NSS
PE6.GPIOParameters=GPIO_Label,PinAttribute
PE6.GPIO_Label=DIB5_CSA
PE6.Locked=true
PE6.PinAttribute=Free
PE6.Signal=GPIO_Output
PE7.GPIOParameters=GPIO_Label,PinAttribute
PE7.GPIO_Label=UART_RX/DIN1
PE7.Locked=true
PE7.Mode=Asynchronous
PE7.PinAttribute=Appli
PE7.Signal=UART7_RX
PE8.GPIOParameters=GPIO_Label,PinAttribute
PE8.GPIO_Label=TFT_IRQ
PE8.Locked=true
PE8.PinAttribute=Free
PE8.Signal=GPXTI8
PF0.GPIOParameters=GPIO_Label,PinAttribute
PF0.GPIO_Label=SDA
PF0.Locked=true
PF0.Mode=I2C
PF0.PinAttribute=Appli
PF0.Signal=I2C2_SDA
PF1.GPIOParameters=GPIO_Label,PinAttribute
PF1.GPIO_Label=SCL
PF1.Locked=true
PF1.Mode=I2C
PF1.PinAttribute=Appli
PF1.Signal=I2C2_SCL
PF10.GPIOParameters=PinAttribute
PF10.Locked=true
PF10.Mode=RGB888
PF10.PinAttribute=Appli
PF10.Signal=LTDC_R1
PF11.GPIOParameters=PinAttribute
PF11.Locked=true
PF11.Mode=RGB888
PF11.PinAttribute=Appli
PF11.Signal=LTDC_B0
PF13.GPIOParameters=GPIO_Label,PinAttribute
PF13.GPIO_Label=DVID_SEL2
PF13.Locked=true
PF13.PinAttribute=Appli
PF13.Signal=GPIO_Output
PF14.GPIOParameters=PinAttribute
PF14.Locked=true
PF14.Mode=RGB888
PF14.PinAttribute=Appli
PF14.Signal=LTDC_G0
PF15.GPIOParameters=GPIO_Label,PinAttribute
PF15.GPIO_Label=DIB4_SCK
PF15.Locked=true
PF15.Mode=Full_Duplex_Master
PF15.PinAttribute=Appli
PF15.Signal=SPI5_SCK
PF2.GPIOParameters=GPIO_Label,PinAttribute
PF2.GPIO_Label=DIB2_IRQ
PF2.Locked=true
PF2.PinAttribute=Free
PF2.Signal=GPXTI2
PF3.GPIOParameters=GPIO_Label,PinAttribute
PF3.GPIO_Label=DIB3_IRQ
PF3.Locked=true
PF3.PinAttribute=Free
PF3.Signal=GPXTI3
PF4.GPIOParameters=GPIO_Label,PinAttribute
PF4.GPIO_Label=DIB4_IRQ
PF4.Locked=true
PF4.PinAttribute=Free
PF4.Signal=GPXTI4
PF6.GPIOParameters=GPIO_Label,PinAttribute
PF6.GPIO_Label=DIB4_CSA
PF6.Locked=true
PF6.Mode=NSS_Signal_Hard_Output
PF6.PinAttribute=Appli
PF6.Signal=SPI5_NSS
PF7.GPIOParameters=GPIO_Label,PinAttribute
PF7.GPIO_Label=UART_TX/DOUT1
PF7.Locked=true
PF7.Mode=Asynchronous
PF7.PinAttribute=Appli
PF7.Signal=UART7_TX
PF9.GPIOParameters=PinAttribute
PF9.Locked=true
PF9.Mode=RGB888
PF9.PinAttribute=Appli
PF9.Signal=LTDC_R0
PG0.GPIOParameters=PinAttribute
PG0.Locked=true
PG0.Mode=RGB888
PG0.PinAttribute=Appli
PG0.Signal=LTDC_R7
PG1.GPIOParameters=PinAttribute
PG1.Locked=true
PG1.Mode=RGB888
PG1.PinAttribute=Appli
PG1.Signal=LTDC_R6
PG11.GPIOParameters=PinAttribute
PG11.Locked=true
PG11.Mode=RMII
PG11.PinAttribute=Appli
PG11.Signal=ETH_RMII_TX_EN
PG12.GPIOParameters=PinAttribute
PG12.Locked=true
PG12.Mode=RGB888
PG12.PinAttribute=Appli
PG12.Signal=LTDC_G1
PG13.GPIOParameters=PinAttribute
PG13.Locked=true
PG13.Mode=RMII
PG13.PinAttribute=Appli
PG13.Signal=ETH_RMII_TXD0
PG14.GPIOParameters=GPIO_Label,PinAttribute
PG14.GPIO_Label=SYSMCU_CS
PG14.Locked=true
PG14.PinAttribute=Free
PG14.Signal=GPIO_Output
PG2.GPIOParameters=PinAttribute
PG2.Locked=true
PG2.Mode=RGB888
PG2.PinAttribute=Appli
PG2.Signal=LTDC_HSYNC
PG3.GPIOParameters=GPIO_Label,PinAttribute
PG3.GPIO_Label=DIB_OE_SYNC
PG3.Locked=true
PG3.PinAttribute=Free
PG3.Signal=GPIO_Output
PH0-OSC_IN(PH0).Locked=true
PH0-OSC_IN(PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN(PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT(PH1).Locked=true
PH1-OSC_OUT(PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT(PH1).Signal=RCC_OSC_OUT
PM11.Locked=true
PM11.Mode=Device_Only
PM11.Signal=USB_OTG_FS_DP
PM12.Locked=true
PM12.Mode=Device_Only
PM12.Signal=USB_OTG_FS_DM
PM13.GPIOParameters=GPIO_Label,PinAttribute
PM13.GPIO_Label=DIB4_MOSI
PM13.Locked=true
PM13.Mode=Full_Duplex_Master
PM13.PinAttribute=Appli
PM13.Signal=SPI5_MOSI
PM14.GPIOParameters=GPIO_Label,PinAttribute
PM14.GPIO_Label=DIB4_MISO
PM14.Locked=true
PM14.Mode=Full_Duplex_Master
PM14.PinAttribute=Appli
PM14.Signal=SPI5_MISO
PM2.GPIOParameters=GPIO_Label,PinAttribute
PM2.GPIO_Label=DIN2
PM2.Locked=true
PM2.PinAttribute=Free
PM2.Signal=GPIO_Input
PM3.GPIOParameters=GPIO_Label,PinAttribute
PM3.GPIO_Label=DIB3_CSA
PM3.Locked=true
PM3.PinAttribute=Free
PM3.Signal=GPIO_Output
PM5.GPIOParameters=PinAttribute
PM5.Locked=true
PM5.Mode=Dual_Role_Device
PM5.PinAttribute=Appli
PM5.Signal=USB_OTG_HS_DM
PM6.GPIOParameters=PinAttribute
PM6.Locked=true
PM6.Mode=Dual_Role_Device
PM6.PinAttribute=Appli
PM6.Signal=USB_OTG_HS_DP
PM8.GPIOParameters=PinAttribute
PM8.Locked=true
PM8.Mode=Activate_VBUS_FS
PM8.PinAttribute=Appli
PM8.Signal=USB_OTG_HS_VBUS
PM9.GPIOParameters=PinAttribute
PM9.Locked=true
PM9.Mode=Dual_Role_Device
PM9.PinAttribute=Appli
PM9.Signal=USB_OTG_HS_ID
PN0.GPIOParameters=PinAttribute
PN0.Locked=true
PN0.Mode=XSPI2_Port2Octo
PN0.PinAttribute=Boot
PN0.Signal=XSPIM_P2_DQS0
PN1.GPIOParameters=PinAttribute
PN1.Locked=true
PN1.Mode=XSPI2_NCS1_Port2
PN1.PinAttribute=Boot
PN1.Signal=XSPIM_P2_NCS1
PN10.GPIOParameters=PinAttribute
PN10.Locked=true
PN10.Mode=XSPI2_Port2Octo
PN10.PinAttribute=Boot
PN10.Signal=XSPIM_P2_IO6
PN11.GPIOParameters=PinAttribute
PN11.Locked=true
PN11.Mode=XSPI2_Port2Octo
PN11.PinAttribute=Boot
PN11.Signal=XSPIM_P2_IO7
PN2.GPIOParameters=PinAttribute
PN2.Locked=true
PN2.Mode=XSPI2_Port2Octo
PN2.PinAttribute=Boot
PN2.Signal=XSPIM_P2_IO0
PN3.GPIOParameters=PinAttribute
PN3.Locked=true
PN3.Mode=XSPI2_Port2Octo
PN3.PinAttribute=Boot
PN3.Signal=XSPIM_P2_IO1
PN4.GPIOParameters=PinAttribute
PN4.Locked=true
PN4.Mode=XSPI2_Port2Octo
PN4.PinAttribute=Boot
PN4.Signal=XSPIM_P2_IO2
PN5.GPIOParameters=PinAttribute
PN5.Locked=true
PN5.Mode=XSPI2_Port2Octo
PN5.PinAttribute=Boot
PN5.Signal=XSPIM_P2_IO3
PN6.GPIOParameters=PinAttribute
PN6.Locked=true
PN6.Mode=XSPI2_Port2Octo
PN6.PinAttribute=Boot
PN6.Signal=XSPIM_P2_CLK
PN8.GPIOParameters=PinAttribute
PN8.Locked=true
PN8.Mode=XSPI2_Port2Octo
PN8.PinAttribute=Boot
PN8.Signal=XSPIM_P2_IO4
PN9.GPIOParameters=PinAttribute
PN9.Locked=true
PN9.Mode=XSPI2_Port2Octo
PN9.PinAttribute=Boot
PN9.Signal=XSPIM_P2_IO5
PO0.GPIOParameters=PinAttribute
PO0.Locked=true
PO0.Mode=XSPI1_NCS1_Port1
PO0.PinAttribute=Boot
PO0.Signal=XSPIM_P1_NCS1
PO2.GPIOParameters=PinAttribute
PO2.Locked=true
PO2.Mode=XSPI1_Port1Hexa
PO2.PinAttribute=Boot
PO2.Signal=XSPIM_P1_DQS0
PO3.GPIOParameters=PinAttribute
PO3.Locked=true
PO3.Mode=XSPI1_Port1Hexa
PO3.PinAttribute=Boot
PO3.Signal=XSPIM_P1_DQS1
PO4.GPIOParameters=PinAttribute
PO4.Locked=true
PO4.Mode=XSPI1_Port1Hexa
PO4.PinAttribute=Boot
PO4.Signal=XSPIM_P1_CLK
PP0.GPIOParameters=PinAttribute
PP0.Locked=true
PP0.Mode=XSPI1_Port1Hexa
PP0.PinAttribute=Boot
PP0.Signal=XSPIM_P1_IO0
PP1.GPIOParameters=PinAttribute
PP1.Locked=true
PP1.Mode=XSPI1_Port1Hexa
PP1.PinAttribute=Boot
PP1.Signal=XSPIM_P1_IO1
PP10.GPIOParameters=PinAttribute
PP10.Locked=true
PP10.Mode=XSPI1_Port1Hexa
PP10.PinAttribute=Boot
PP10.Signal=XSPIM_P1_IO10
PP11.GPIOParameters=PinAttribute
PP11.Locked=true
PP11.Mode=XSPI1_Port1Hexa
PP11.PinAttribute=Boot
PP11.Signal=XSPIM_P1_IO11
PP12.GPIOParameters=PinAttribute
PP12.Locked=true
PP12.Mode=XSPI1_Port1Hexa
PP12.PinAttribute=Boot
PP12.Signal=XSPIM_P1_IO12
PP13.GPIOParameters=PinAttribute
PP13.Locked=true
PP13.Mode=XSPI1_Port1Hexa
PP13.PinAttribute=Boot
PP13.Signal=XSPIM_P1_IO13
PP14.GPIOParameters=PinAttribute
PP14.Locked=true
PP14.Mode=XSPI1_Port1Hexa
PP14.PinAttribute=Boot
PP14.Signal=XSPIM_P1_IO14
PP15.GPIOParameters=PinAttribute
PP15.Locked=true
PP15.Mode=XSPI1_Port1Hexa
PP15.PinAttribute=Boot
PP15.Signal=XSPIM_P1_IO15
PP2.GPIOParameters=PinAttribute
PP2.Locked=true
PP2.Mode=XSPI1_Port1Hexa
PP2.PinAttribute=Boot
PP2.Signal=XSPIM_P1_IO2
PP3.GPIOParameters=PinAttribute
PP3.Locked=true
PP3.Mode=XSPI1_Port1Hexa
PP3.PinAttribute=Boot
PP3.Signal=XSPIM_P1_IO3
PP4.GPIOParameters=PinAttribute
PP4.Locked=true
PP4.Mode=XSPI1_Port1Hexa
PP4.PinAttribute=Boot
PP4.Signal=XSPIM_P1_IO4
PP5.GPIOParameters=PinAttribute
PP5.Locked=true
PP5.Mode=XSPI1_Port1Hexa
PP5.PinAttribute=Boot
PP5.Signal=XSPIM_P1_IO5
PP6.GPIOParameters=PinAttribute
PP6.Locked=true
PP6.Mode=XSPI1_Port1Hexa
PP6.PinAttribute=Boot
PP6.Signal=XSPIM_P1_IO6
PP7.GPIOParameters=PinAttribute
PP7.Locked=true
PP7.Mode=XSPI1_Port1Hexa
PP7.PinAttribute=Boot
PP7.Signal=XSPIM_P1_IO7
PP8.GPIOParameters=PinAttribute
PP8.Locked=true
PP8.Mode=XSPI1_Port1Hexa
PP8.PinAttribute=Boot
PP8.Signal=XSPIM_P1_IO8
